In [4]:
import pandas as pd

In [22]:
#creating data whose inconsistencies is to be removed
data={
    "date":['13-01-2024','13/02/2024','03-15-2024','2024-03-18'],
    "father_age":[66,45,37,49],
    "sons_age":[78,25,25,52],
    "city":["Dadu","Daud","Nawabshah","Nawabshah"],
    "country":["USA","United States","U.S.A","America"]
}

In [24]:
#converting the dictionary dataset into dataframe of pandas
dataframe=pd.DataFrame(data)
dataframe.head()

         date  father_age  sons_age       city        country
0  13-01-2024          66        78       Dadu            USA
1  13/02/2024          45        25       Daud  United States
2  03-15-2024          37        25  Nawabshah          U.S.A
3  2024-03-18          49        52  Nawabshah        America

In [29]:
#converting incorrect date formats in correct date formats
dataframe['date']=pd.to_datetime(dataframe['date'], errors="coerce")
dataframe['date']=dataframe['date'].dt.strftime("%y-%M-%d")
dataframe['date']=dataframe['date'].fillna("19-10-2024")
dataframe.head()

C:\Users\NEW\AppData\Local\Temp\ipykernel_18316\1505189398.py:2: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  dataframe['date']=pd.to_datetime(dataframe['date'], errors="coerce")

         date  father_age  sons_age       city        country
0    24-00-13          66        78       Dadu            USA
1  19-10-2024          45        25       Dadu  United States
2  19-10-2024          37        25  Nawabshah          U.S.A
3  19-10-2024          49        52  Nawabshah        America

In [37]:
#setting all the values of country column to USA
dataframe['country']=dataframe['country'].replace({"USA":"United States","U.S.A":"United States","America":"United States"})
dataframe.head()

         date  father_age  sons_age       city        country
0    24-00-13          66        78       Dadu  United States
2  19-10-2024          37        25  Nawabshah  United States

In [45]:
#correcting typographical mistakes
dataframe["city"]=dataframe["city"].replace({"Daud":"Dadu"})
dataframe.head()

         date  father_age  sons_age       city        country
0    24-00-13          66        78       Dadu  United States
2  19-10-2024          37        25  Nawabshah  United States

In [49]:
#removing those rows in which the father's age is less than son's age
dataframe=dataframe.drop(dataframe[dataframe["father_age"]<=dataframe["sons_age"]].index)
dataframe.head()

         date  father_age  sons_age       city        country
2  19-10-2024          37        25  Nawabshah  United States

In [38]:
#removing duplicates of country column
dataframe=dataframe.drop_duplicates(subset="city")
dataframe.head()